activity/app/views/devices/_device.html.erb

    <strong>Assigned to:</strong>
    <% if device.employee.present? %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]