activity/app/views/dashboard/index.html.erb

      <td><%= catigory.name %></td>
      <td><%= catigory.devices.count %></td>
      <td><%= catigory.devices.where.not({ :employee_id => nil }).count %></td>
      <td><%= catigory.devices.where({ :employee_id => nil }).count %></td>
---
SELECT COUNT(*) FROM "devices" WHERE "devices"."catigory_id" = ?  [["catigory_id", "1"]]
SELECT COUNT(*) FROM "devices" WHERE "devices"."catigory_id" = ? AND "devices"."employee_id" IS NOT NULL  [["catigory_id", "1"]]
SELECT COUNT(*) FROM "devices" WHERE "devices"."catigory_id" = ? AND "devices"."employee_id" IS NULL  [["catigory_id", "1"]]