activity/app/controllers/catigories_controller.rb

SELECT "catigories".* FROM "catigories"
---
  def index
    @catigories = Catigory.all

INSERT INTO "catigories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Desktop"], ["created_at", "2023-10-10 02:48:20.502156"], ["updated_at", "2023-10-10 02:48:20.502156"]]
---
  def create
    @catigory = Catigory.new(catigory_params)

    respond_to do |format|
      if @catigory.save

SELECT "catigories".* FROM "catigories" WHERE "catigories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_catigory
      @catigory = Catigory.find(params[:id])