activity/app/controllers/devices_controller.rb

  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save
---
INSERT INTO "devices" ("Name", "created_at", "updated_at", "manufacturer_id", "catigory_id", "employee_id") VALUES (?, ?, ?, ?, ?, ?)  [["Name", "lenovo"], ["created_at", "2023-10-17 04:38:29.341750"], ["updated_at", "2023-10-17 04:38:29.341750"], ["manufacturer_id", "1"], ["catigory_id", "2"], ["employee_id", "5"]]

  def destroy
    @device.destroy
---
DELETE FROM "devices" WHERE "devices"."id" = ?  [["id", 2]]