activity/app/controllers/employees_controller.rb

INSERT INTO "employees" ("Firstname", "Lastname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Firstname", ""], ["Lastname", ""], ["created_at", "2023-10-10 01:12:24.954260"], ["updated_at", "2023-10-10 01:12:24.954260"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "updated_at" = ? WHERE "employees"."id" = ?  [["updated_at", "2023-10-17 04:24:56.080586"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)