activity/app/controllers/manufacturers_controller.rb

INSERT INTO "manufacturers" ("name", "website", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "microsoft"], ["website", "microsoft.com\n"], ["created_at", "2023-10-17 02:01:53.594872"], ["updated_at", "2023-10-17 02:01:53.594872"]]
---
  def create
    @manufacturer = Manufacturer.new(manufacturer_params)

    respond_to do |format|
      if @manufacturer.save

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_manufacturer
      @manufacturer = Manufacturer.find(params[:id])