activity/app/controllers/softwares_controller.rb

SELECT "softwares".* FROM "softwares"
---
  def index
    @softwares = Software.all

INSERT INTO "softwares" ("name", "License_count", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "windows"], ["License_count", 3], ["created_at", "2023-10-17 03:11:00.963942"], ["updated_at", "2023-10-17 03:11:00.963942"]]
---
  def create
    @software = Software.new(software_params)

    respond_to do |format|
      if @software.save

SELECT "softwares".* FROM "softwares" WHERE "softwares"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_software
      @software = Software.find(params[:id])