activity/app/views/employees/_employee.html.erb

SELECT "devices".* FROM "devices" WHERE "devices"."employee_id" = ?  [["employee_id", 5]]
---
  <ul>
    <% employee.devices.each do |device| %>

SELECT "softwares".* FROM "softwares" INNER JOIN "employees_softwares" ON "softwares"."id" = "employees_softwares"."software_id" WHERE "employees_softwares"."employee_id" = ?  [["employee_id", 5]]
---
  <ul>
    <% employee.softwares.each do |software| %>