activity/app/views/softwares/_software.html.erb

SELECT "employees".* FROM "employees" INNER JOIN "employees_softwares" ON "employees"."id" = "employees_softwares"."employee_id" WHERE "employees_softwares"."software_id" = ?  [["software_id", 1]]
---
    <ul>
      <% software.employees.each do |e| %>